#! /usr/bin/env bash
set -e
CUR_DIR="$( cd "$( dirname "${BASH_SOURCE[0]}" )" && pwd )"
. $CUR_DIR/env-vars.sh

curl -v -G "http://localhost:$LTT_SVC_PORT/analyze"\
    --data-urlencode "text=বাংলাদেশেরবর্তমানসীমান্ততৈরিহয়েছিল১৯৪৭খ্রিস্টাব্দেযখনব্রিটিশসাম্রাজ্যব্রিটিশঔপনিবেশিকশাসনাবসানে,বঙ্গভঙ্গ১৯৪৭বঙ্গবেঙ্গলপ্রেসিডেন্সিএবংভারতবিভাজনব্রিটিশভারতবিভাজনকরাহয়েছিলবিভাজনেরপরেবর্তমানবাংলাদেশেরঅঞ্চলতখনপূর্ববাংলানামেপরিচিতছিল,যেটিনবগঠিতদেশপাকিস্তানপাকিস্তানেরপূর্বঅঞ্চলহিসেবেপ্রতিষ্ঠিতকরাহয়েছিলপাকিস্তানঅধিরাজ্যপাকিস্তানঅধিরাজ্যেথাকাকালীনপূর্ববাংলাথেকেপূর্বপাকিস্তানএনামটিপরিবর্তিতকরাহয়েছিলশোষণ,বৈষম্যওনিপীড়নেরবিরুদ্ধেবাংলাদেশেরস্বাধীনতাযুদ্ধসশস্ত্রসংগ্রামেরমধ্যদিয়ে১৯৭১খ্রিস্টাব্দেবাংলাদেশএকটিস্বাধীনওসার্বভৌমদেশহিসাবেপ্রতিষ্ঠিতহয়স্বাধীনতাপরবর্তীসময়েদারিদ্র্যপীড়িতবাংলাদেশেবিভিন্নসময়ঘটেছেদুর্ভিক্ষওপ্রাকৃতিকদুর্যোগএছাড়াওপ্রলম্বিতরাজনৈতিকঅস্থিতিশীলতাওপুনঃপৌনিকবাংলাদেশেসামরিকঅভ্যুত্থানসামরিকঅভ্যুত্থানএদেশেরসামগ্রিকরাজনৈতিকস্থিতিশীলতাবারংবারব্যাহতকরেছেগণসংগ্রামেরমধ্যদিয়ে১৯৯১খ্রিস্টাব্দেগণতন্ত্রগণতান্ত্রিকশাসনব্যবস্থাপুনঃপ্রতিষ্ঠিতহয়েছেযারধারাবাহিকতাআজপর্যন্তসকলপ্রতিকূলতাসত্ত্বেওগতদুইদশকেবাংলাদেশেরঅর্থনীতিবাংলাদেশেরঅর্থনৈতিকপ্রগতিওসমৃদ্ধিসারাবিশ্বেস্বীকৃতিলাভকরেছে"
#    --data-urlencode "text=খালিদ  জামিলকে দেখে মনে হচ্ছে খাঁচাবন্দি ‘বাঘ’..!"
